#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_string.suffix: Refreshing state... [id=SSSQrpuN]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0bf3fb417cc06c090]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::261106957109:policy/devops-ninja-eks-SSSQrpuN-elb-sl-role-creation20230218215142674600000003]
module.eks.aws_iam_policy.cluster_deny_log_group[0]: Refreshing state... [id=arn:aws:iam::261106957109:policy/devops-ninja-eks-SSSQrpuN-deny-log-group20230218215142669600000002]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218215142661500000001]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0831935db15f73b59]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218215142661500000001-20230218215143539300000008]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218215142661500000001-20230218215143426300000006]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218215142661500000001-20230218215143522900000007]
module.eks.aws_iam_role_policy_attachment.cluster_deny_log_group[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218215142661500000001-20230218215143411600000004]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218215142661500000001-20230218215143422000000005]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a3b91070834b3b49]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-068ee5123ab8a45b0]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-047399f5e0e3c0681]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-081294bae263fa00a]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00d3fe6c64cb615ac]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-0709098e9ce9e27d7]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0bd8884c594f60f5b]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0b07f6385db955545]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-066c696499116fc32]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-055add79182906888]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0fd1907e73600a101]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-01c93e0c77b884900]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0ee1fa147a5facd17]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-0663727d343a9f66d]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-470887055]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-055add791829068881080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-00bda7d9047846864]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-01cf2d353630ad2e5]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ac945d73c0d07ea6]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-047225cc611dbb639]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-081186370d79e1124]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d73642770843b860]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0306ba972f000da6c]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-1439235237]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-4004731702]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-2509665154]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-2970643229]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-3551837232]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0a3b91070834b3b491080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218222435567700000001]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=57200334134001de9be503e2aec7923939e1ee7c]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218222435567700000001-20230218222436357800000004]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218222436243700000003]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218222436242400000002]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218222435567700000001-20230218222436589800000006]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN20230218222435567700000001-20230218222436580600000005]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN-worker-group-220230218222436921600000008]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN-worker-group-120230218222436910700000007]
module.eks.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN-worker-group-220230218224301411900000001]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=devops-ninja-eks-SSSQrpuN-worker-group-120230218224301424100000002]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.aws_autoscaling_group.workers[0] has been changed
  ~ resource "aws_autoscaling_group" "workers" {
      + enabled_metrics           = []
        id                        = "devops-ninja-eks-SSSQrpuN-worker-group-120230218224301424100000002"
      + load_balancers            = []
        name                      = "devops-ninja-eks-SSSQrpuN-worker-group-120230218224301424100000002"
      + target_group_arns         = []
        # (22 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }
  # module.eks.aws_autoscaling_group.workers[1] has been changed
  ~ resource "aws_autoscaling_group" "workers" {
      + enabled_metrics           = []
        id                        = "devops-ninja-eks-SSSQrpuN-worker-group-220230218224301411900000001"
      + load_balancers            = []
        name                      = "devops-ninja-eks-SSSQrpuN-worker-group-220230218224301411900000001"
      + target_group_arns         = []
        # (22 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }
  # module.eks.kubernetes_config_map.aws_auth[0] has been changed
  ~ resource "kubernetes_config_map" "aws_auth" {
      ~ data        = {
          ~ "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::261106957109:role/devops-ninja-eks-SSSQrpuN20230218222435567700000001"
                  "username": "system:node:{{EC2PrivateDNSName}}"
              + - rolearn: arn:aws:iam::261106957109:role/devops-ninja-eks-SSSQrpuN20230218215142661500000001
              +   username: system:node:{{EC2PrivateDNSName}}
              +   groups: 
              +     - system:bootstrappers
              +     - system:nodes
              +     - system:masters
            EOT
          ~ "mapUsers"    = <<-EOT
              - []
              + - userarn: arn:aws:iam::261106957109:user/fernandomullerjr8596
              +   username: admin-user
              +   groups:
              +     - system:masters
            EOT
            # (1 unchanged element hidden)
        }
        id          = "kube-system/aws-auth"
        # (2 unchanged attributes hidden)

      ~ metadata {
            name             = "aws-auth"
          ~ resource_version = "902" -> "20904"
            # (5 unchanged attributes hidden)
        }
    }
  # module.eks.local_file.kubeconfig[0] has been deleted
  - resource "local_file" "kubeconfig" {
      - content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://5C21DF7350A6C37787AE5C231BF1B2A5.gr7.us-east-2.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJek1ESXhPREl5TWpFd01Wb1hEVE16TURJeE5USXlNakV3TVZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTHc5Cjhnbm1qZU0yN1JSZGlIZkZUTTZzcDdZazBwTDlPaHhTZnN3UGlIVk8xUm9kK3IxL2o0RG1lMlFWMUR5Q0gvU2kKRkQrOERPZDN1bmR6TlFudG9sREtuMGNwQlgzVWZpOUo4WHJzREdxc0VvR3J5dXFKK2Q1ZlRvSWUxTU9Ta1dPTgp2RUg3TDNMVXllYlRwSHpkNk14VzFxeUJueENrb242SHRyaVNLL2FMU1FjVzduRFVZQ09KQ1hoRFNYa0xKT3Y3CndrejJEUWg5STJxV0NoRzlNK1dlZTlwdk9XSVVUd0t5aUNTaEp2eEZXWGJUOTRFZFA3bnppbVE4TVVMZCttU0sKNGFQZXRwRFVDY3U2dnpIQnFsTmdaOHRzTmdGSjY1aHFPN0dYa2t5Y25wYWxtYWVkaG5sRllhNHV4RWREM25nQQoxaVI0VTJhVXNSNGNkUnRSejhVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZDbWxQaHhBZkpuTXpuOTZRSm9WRGJ5RS9pRG5NQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCZ3VQZlY0NFg5VXk1SEUzZGVOczNHWURzaERYcVE2V0RPRlJXSzFBKy9CbVRCNGJLbgp2YkdrR2VPMVRQUktrSzc1eUFvMkhnZEl1M0lSeVdvMXpzcjdXNHQ2L1hFQnl4OXg3MjFHbVpuQkV2T1hHZnJRCkFOcW1UUGVxR1pmeHExZGRoVTlTWFRMT1FKNzZ2TmJ4cERsRFJyUTBlSEQ3Ui9RTDh4YUIyZ2loQlkweEZReDMKaTJBUWFRdUVhclhkVVBuL0JWekhDQWduOUJ5anRHN0tQcUkzbTlObmlPdjI4OEZzbityT29NaTNTTEpxZjdKNwp2MFRZdm1kUXJrZHkvNVZhZk1GUXFGSHBaZzNtNndnZ0pGaDJYWEJJcEE4QWZKMUxWZGtKQytndkJnOFR0SFVjCmROT1pGUnNsK0JXWEFYdmNQciszQ1BiYWdIVTUvb1h0ekZFTAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_devops-ninja-eks-SSSQrpuN
            
            contexts:
            - context:
                cluster: eks_devops-ninja-eks-SSSQrpuN
                user: eks_devops-ninja-eks-SSSQrpuN
              name: eks_devops-ninja-eks-SSSQrpuN
            
            current-context: eks_devops-ninja-eks-SSSQrpuN
            
            users:
            - name: eks_devops-ninja-eks-SSSQrpuN
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "devops-ninja-eks-SSSQrpuN"
        EOT -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0600" -> null
      - filename             = "./kubeconfig_devops-ninja-eks-SSSQrpuN" -> null
      - id                   = "57200334134001de9be503e2aec7923939e1ee7c" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.eks.aws_autoscaling_group.workers[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "devops-ninja-eks-SSSQrpuN-worker-group-120230218224301424100000002"
      ~ launch_configuration      = "devops-ninja-eks-SSSQrpuN-worker-group-120230218222436910700000007" -> (known after apply)
        name                      = "devops-ninja-eks-SSSQrpuN-worker-group-120230218224301424100000002"
        # (24 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.eks.aws_autoscaling_group.workers[1] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "devops-ninja-eks-SSSQrpuN-worker-group-220230218224301411900000001"
      ~ launch_configuration      = "devops-ninja-eks-SSSQrpuN-worker-group-220230218222436921600000008" -> (known after apply)
        name                      = "devops-ninja-eks-SSSQrpuN-worker-group-220230218224301411900000001"
        # (24 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:us-east-2:261106957109:launchConfiguration:e883ddd6-ee0f-48f5-948c-b96963e977d2:launchConfigurationName/devops-ninja-eks-SSSQrpuN-worker-group-120230218222436910700000007" -> (known after apply)
      ~ id                               = "devops-ninja-eks-SSSQrpuN-worker-group-120230218222436910700000007" -> (known after apply)
      ~ instance_type                    = "t3a.micro" -> "t3.micro" # forces replacement
      + key_name                         = (known after apply)
      ~ name                             = "devops-ninja-eks-SSSQrpuN-worker-group-120230218222436910700000007" -> (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (8 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_launch_configuration.workers[1] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:us-east-2:261106957109:launchConfiguration:01736bad-d750-411e-908d-af1e01c02d78:launchConfigurationName/devops-ninja-eks-SSSQrpuN-worker-group-220230218222436921600000008" -> (known after apply)
      ~ id                               = "devops-ninja-eks-SSSQrpuN-worker-group-220230218222436921600000008" -> (known after apply)
      ~ instance_type                    = "t3a.micro" -> "t3.micro" # forces replacement
      + key_name                         = (known after apply)
      ~ name                             = "devops-ninja-eks-SSSQrpuN-worker-group-220230218222436921600000008" -> (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (8 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.kubernetes_config_map.aws_auth[0] will be updated in-place
  ~ resource "kubernetes_config_map" "aws_auth" {
      ~ data        = {
          ~ "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::261106957109:role/devops-ninja-eks-SSSQrpuN20230218222435567700000001"
                  "username": "system:node:{{EC2PrivateDNSName}}"
              - - rolearn: arn:aws:iam::261106957109:role/devops-ninja-eks-SSSQrpuN20230218215142661500000001
              -   username: system:node:{{EC2PrivateDNSName}}
              -   groups: 
              -     - system:bootstrappers
              -     - system:nodes
              -     - system:masters
            EOT
          ~ "mapUsers"    = <<-EOT
              - - userarn: arn:aws:iam::261106957109:user/fernandomullerjr8596
              -   username: admin-user
              -   groups:
              -     - system:masters
              + []
            EOT
            # (1 unchanged element hidden)
        }
        id          = "kube-system/aws-auth"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://5C21DF7350A6C37787AE5C231BF1B2A5.gr7.us-east-2.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJek1ESXhPREl5TWpFd01Wb1hEVE16TURJeE5USXlNakV3TVZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTHc5Cjhnbm1qZU0yN1JSZGlIZkZUTTZzcDdZazBwTDlPaHhTZnN3UGlIVk8xUm9kK3IxL2o0RG1lMlFWMUR5Q0gvU2kKRkQrOERPZDN1bmR6TlFudG9sREtuMGNwQlgzVWZpOUo4WHJzREdxc0VvR3J5dXFKK2Q1ZlRvSWUxTU9Ta1dPTgp2RUg3TDNMVXllYlRwSHpkNk14VzFxeUJueENrb242SHRyaVNLL2FMU1FjVzduRFVZQ09KQ1hoRFNYa0xKT3Y3CndrejJEUWg5STJxV0NoRzlNK1dlZTlwdk9XSVVUd0t5aUNTaEp2eEZXWGJUOTRFZFA3bnppbVE4TVVMZCttU0sKNGFQZXRwRFVDY3U2dnpIQnFsTmdaOHRzTmdGSjY1aHFPN0dYa2t5Y25wYWxtYWVkaG5sRllhNHV4RWREM25nQQoxaVI0VTJhVXNSNGNkUnRSejhVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZDbWxQaHhBZkpuTXpuOTZRSm9WRGJ5RS9pRG5NQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCZ3VQZlY0NFg5VXk1SEUzZGVOczNHWURzaERYcVE2V0RPRlJXSzFBKy9CbVRCNGJLbgp2YkdrR2VPMVRQUktrSzc1eUFvMkhnZEl1M0lSeVdvMXpzcjdXNHQ2L1hFQnl4OXg3MjFHbVpuQkV2T1hHZnJRCkFOcW1UUGVxR1pmeHExZGRoVTlTWFRMT1FKNzZ2TmJ4cERsRFJyUTBlSEQ3Ui9RTDh4YUIyZ2loQlkweEZReDMKaTJBUWFRdUVhclhkVVBuL0JWekhDQWduOUJ5anRHN0tQcUkzbTlObmlPdjI4OEZzbityT29NaTNTTEpxZjdKNwp2MFRZdm1kUXJrZHkvNVZhZk1GUXFGSHBaZzNtNndnZ0pGaDJYWEJJcEE4QWZKMUxWZGtKQytndkJnOFR0SFVjCmROT1pGUnNsK0JXWEFYdmNQciszQ1BiYWdIVTUvb1h0ekZFTAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_devops-ninja-eks-SSSQrpuN
            
            contexts:
            - context:
                cluster: eks_devops-ninja-eks-SSSQrpuN
                user: eks_devops-ninja-eks-SSSQrpuN
              name: eks_devops-ninja-eks-SSSQrpuN
            
            current-context: eks_devops-ninja-eks-SSSQrpuN
            
            users:
            - name: eks_devops-ninja-eks-SSSQrpuN
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "devops-ninja-eks-SSSQrpuN"
        EOT
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_devops-ninja-eks-SSSQrpuN"
      + id                   = (known after apply)
    }

Plan: 3 to add, 3 to change, 2 to destroy.

Changes to Outputs:
  ~ config_map_aws_auth = [
      ~ {
          ~ metadata    = [
              ~ {
                  ~ resource_version = "902" -> "20904"
                    # (7 unchanged elements hidden)
                },
            ]
            # (4 unchanged elements hidden)
        },
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @fernandomullerjr, Action: `pull_request`*